const services = [
    {
        name: 'education',
        title: 'خدمات تعليمية',
        image: 'static/media/education.jpg',
        description: `
        الأفكار المتعلقة بتقديم وتوفير المتطلبات (الخدمات ) التعليمية الأساسية التي تؤدي إلى رفع كفاءة أبنائنا الطلاب ، وإلى رضاء جميع المستفيدين ، وتعتمد على مبادئ الجودة الشاملة ، والتي تنص على أن الجميع شركاء من اجل الجودة

تنقسم الخدمات التعليمية إلى ثلاثة أقسام :
1. خدمات البنية الأساسية : وتشمل بناء مدارس جديدة لاستيعاب النمو الطبيعي لأعداد الطلبة ، إصلاح وترميم المدارس الحالية ، تطوير مشروع مدارس الفتيات ، توفير الكتب المدرسية ، إنشاء وتطوير وتحديث وصيانة المعامل المختلفة ( أوساط ـ علوم ـ مكتبة....الخ ).

2. خدمات تحسين نوعية التعليم والتعلم : وتشمل تطوير المنهج و تقويمه ، تدريب جميع المعلمين على المنهج ، إنتاج مواد وأجهزة تعليمية للمنهج ، تدريب المعلمين الجدد ، تطوير استراتيجيات التعلم المستخدمة ، تدريب المشرفين التربويين ، التوسع في تأسيس شبكة الإنترنت بالمدارس ، تطوير نظام القياس والتقويم ، تفعيل مشروع المدرسة وحدة تدريب ، اتخاذ الإجراءات التقنية لتنفيذ التعلم عن بعد... الخ .

3. خدمات تطوير النظام الإداري : وتشمل تدريب مديري المدارس من خلال برامج التطوير المهني ، تجديد وتطوير نظام المعلومات الإداري ، تطوير الآليات والأدوات لتحضير وتنفيذ الخطط السنوية على كل المستويات ، إعداد خطة للتوجه نحو اتخاذ القرارات اللامركزية ، تنمية علاقة مؤسسات المجتمع المدني بالنظام التربوي
        `
    },
    {
        name: 'housing',
        title: 'خدمات الاسكان الاجتماعي',
        image: 'static/media/housing.png',
        description: `
        برنامج يقوم بتوفير وحدات سكنية لذوي الدخل المحدود في مناطق معينة كالطبقة المتوسطة والطبقة الكادحة وعادة يكون له شروط خاصة تضعها الهيئة العامة للدولة كأن يكون المتقدم شخص طبيعي مصري الجنسية ويُحظر عليه شراء الوحدات نقدًا ويلتزم بالتعاقد والسداد بنظام التمويل العقاري كما أنه لا يحق للمتقدم حجز أكثر من وحدة سكنية وهناك نوعان من الاسكان الاجتماعي وهما الاسكان الاجتماعي الحر والاسكان الاجتماعي العادي والحر هو أغلى سعرًا من العادي كما أنه لا يوجد أي دعم على الإسكان الحر بل تباع الوحدات بهامش ربح للوزارة تسمح لها بالصرف على باقي مشروعات محدودي الدخل كما تختلف طريقة السداد في الحر فهي لا تسير بنظام التمويل العقاري كما أشرنا مسبقًا إنما طريقة السداد في الإسكان الحر تتمثل في دفع نسبة من المبلغ الأصلي كجدية حجز ثم يسدد باقي إجمالي ثمن الوحدة بإحدى الطرق الآتية:
سداد فوري نقداً أو سداد بالتقسيط على أن يكون التقسيط كالآتي: 30% من إجمالي قيمة الوحدة عند الاستلام ثم سداد دفعات ربع سنوية متساوية على 3 سنوات ويحتوي على العديد من الخدمات كإنشاء طلب دعم لوحدة سكنية وتعديل طلب الدعم والاستعلام عن بيانات المدفوعات وحساب قيمة الدعم المختلف المقدمة لكل فرد على حدة
        `
    },
    {
        name: 'judicial',
        title: 'خدمات قضائية',
        image: 'static/media/judge.jpg',
        description: `
        المقصود بها كل ما يخص شئون القضية كالاستعلام عن بيانات الدعوي والاستعلام عن حدوث الاستئناف أو وجوده من عدمه والاستعلام عن رول دعوي والاستعلام عن المطالبات
        `
    },
    {
        name: 'license',
        title: 'خدمات رخصي',
        image: 'static/media/license.jpg',
        description: `
        خانة خاصة برخصة القيادة وهي وثيقة رسمية تسمح لحاملها بممارسة القيادة لفترة معينة حتي انهائها وتجديدها مرة أخرى ولها أنواع مختلفة،رخصة قيادة خاصة: لمن يقود سيارة لا تزيد سعتها على 8 أشخاص، أو سيارة نقل خاص “بيك أب” لا يزيد وزنها على 3.5 طن. ، رخصة قيادة عامة، والتي تنقسم إلى:
1. فئة أولى: رخصة أجرة عامة لسيارة لا تزيد سعتها على 8 أشخاص.
2. فئة ثانية: سيارة نقل، وتنقسم إلى رخصة قيادة النقل الخفيف بما لا يزيد وزنه على 3.5 طن، ورخصة قيادة النقل الثقيل بما يزيد على ذلك.
3. فئة ثالثة: رخصة قيادة الحافلات، وتنقسم إلى حافلة صغيرة بما لا يزيد عدد ركابها على 15 راكباً، وحافلة كبيرة بما يزيد على ذلك.
4. رخصة مركبات أشغال عامة: ويتم تحديد نوع المعدة أو الآلة في رخصة القيادة.
5. رخصة دراجة آلية: لقيادة الدراجات الآلية بكل أنواعها.
يُذكر أنه يجوز الجمع بين أكثر من رخصة وتكون الرخص ذات مواصفات أمنية عالية، وتُحدد الإدارة العامة للمرور البيانات التي تشتمل عليها. وفي هذا القسم العديد من الخدمات   كاستعلام عن مخالفات أو سداد مخالفات أو اصدار بدل تالف أو بدل فاقد لرخصة القيادة أو سداد المخالفات لمالك اخر
        `
    },
    {
        name: 'tax',
        title: 'خدمات الضرئب العقارية',
        image: 'static/media/tax.jpg',
        description: `
        ضريبة مفروضة بالفعل بموجب القانون رقم 56 لسنة 1954 وقد تعارف عليها المجتمع بــ "العوايد"، وقد أعيد تنظيم أحكامها بالقانون الحالي رقم 196 لسنة 2008 و المكلف بأداء الضريبة هو الشخص الطبيعي أو الاعتبارى الذى له الحق في ملكية العقار أو الانتفاع به أو استغلاله، أما المستأجر فلا يعد - مكلفًا بأداء الضريبة - وإنما يعد متضامناً مع المكلف في سداد الضريبة في حدود الأجرة المستحقة عليه كما أنة لايجوز الرجوع على المستأجر لسداد الضريبة الا فى حدود الأجرة المستحقة علية وبعد رفض المالك سدادها وبعد أن تخطرة مصلحة الضرائب العقارية بذلك بكتاب موصى علية بعلم الوصول وفى هذة الحالة يعد الايصال الذى يحصل علية المستأجر – بما يفيد تحصيل الضريبة منه – ايصال من المكلف بأداء الضريبة بأستيفائة للأجرة المستحقة لة وفى حدود ماتم أداؤة للمصلحة وبالتالى لايجوز للمالك الرجوع على المستأجر بطلب الاجرة المسددة منة لجهة التحصيل أو اقامة دعاوى قضائية بطردة لعدم سداد الاجرة تبلغ سعر الضريبة موحد 10% من القيمة الإيجارية السنوية بعد خصم 30% مصاريف للسكني، 32% لغير السكنى مقابل جميع المصروفات التي يتكبدها المكلف بأداء الضريبة بما فيها مصاريف الصيانة ، و تأتي أهمية التفرقة بين الضريبة العقارية و ضريبة التصرفات العقارية نتيجة لما ساد في الفترة الأخيرة من خلط بين الضريبتين، و يمكن التفرقه بينهما على النحو التالي : 

- ضريبة التصرفات العقارية هي جزء من ضريبة الدخل تُسدد لمرة واحدة عند التصرف فى العقار وتفرض بنسبة 2.5% من قيمة التصرف، فضريبة التصرفات العقارية هى أحد أنواع الضرائب المباشرة التي يدفعها المواطن وتتولى تحصيلها مصلحة الضرائب المصرية. 

- أما الضريبة العقارية تفرض على العقارات المبنية وتسدد سنوياً بنسبة (10%) من صافي القيمة الإيجارية للعقار (الوحدة) وأن السكن الخاص (الوحدة السكنية التي يتخذها المواطن سكنا رئيسيا له ولأسرته) معفى حتى أقل من 2 مليون جنيه ويخضع ما زاد للضريبة. ويتولى تحصيلها مصلحة الضرائب العقارية حيث تحصل ضريبة على الوحدات السكنية التي تقدر قيمتها ب 2 مليون جنيه فأكثر، فمثلاً إذا بلغت قيمة الوحدة السكنية مبلغ 2 مليون جنيه فإن الضريبة العقارية المستحقة عنها تُقدر بـ 120 جنيها فقط سنويًا. 
وتشمل الخدمة هنا تقديم اقرار وحدات سكنية
        `
    },
    {
        name: 'commercial',
        title: 'خدمات السجل التجاري ',
        image: 'static/media/commercial.jpg',
        description: `
        وسيلة لجمع المعلومات الوافية عن التجار والمؤسسات التجارية والشركات التجارية هو أيضاً أداة للنشر والإعلان
حيث يمكن جعل مندرجاته نافذة في حق الغير عند وجود نص قانوني صريح بهذا المعنى. وأحياناً، يكون إدراج أمر ما في السجل التجاري، شرطاً لصحة العمل القانوني فهو لتنظيم حركة التجارة الداخلية، وقيد البيانات الخاصة بكل تاجر ويتم تخصيص صفحة أو مكان لكل تاجر على حدة ويتم تسجيل نشاط كل تاجر وما يحدث من تغيرات على نشاطه، ويأتى الغرض من وجوده هو توفير أكبر كم من المعلومات عن الباعة والتجار بمختلف حجم الأنشطة الخاصة بهم سواء لأفراد أو لمؤسسات كبيرة، ويتم استخراجه الغرف التجارية المتواجدة فى المحافظة التابع لها نشاطه، أو مكاتب السجلات التجارية ، وبالتالى يمكن الدولة من تحديد الكميات المطلوبة لسد احتياجاتها من أى منتج اضافة لتحديد حجم التجارة داخل السوق وهو ما يمكنها من رسم، ووضع المعالم الاقتصادية تحديد اليات تطوير وزيادة الانتاج فى كافة المجالات صناعية أو زراعية أو تجارية، كما أن السجل يوفر للحكومة المعلومات الخاصة بعناوين وأرقام التجار فى كافة أنحاء الدولة ما يتيح للمصنع أو المزارع معرفة أماكن التى يمكن أو يسوق فيها منتجاته من خلال الاستفسار من ادارة السجلات بوزارة التموين والتجارة الداخلية ويتطلب السجل التجارى عدة مستندات لاستخراجه وهى :
طلب استخراج سجل تجارى صورة من البطاقة الضريبية
صورة من بطاقة الرقم القومى شخصية أو عائلية سارية لصاحب المنشأة والشركاء فى حال وجودهم.عقد إيجار موثق من الشهر العقارى مثبت التاريخ أو سند ملكية العقار المستخدم للنشاط.وإيصال كهرباء، أو إخطار يفيد تركيب العداد الكهربائى، صحيفة الحالة الجنائية
طلب مدفوع من الغرفة التجارية لاستخراج شهادة لمزاولة المهنة.صورة من توكيل رسمى، صورة من عقد الشركة ، وتقدم أصول جميع مستندات الشركة للإطلاع
ويقسم السجل التجاري الى نوعين:
- سجل عام يسجّل فيه التجار والشركات.
- سجل خاص تسجّل فيه المؤسسات التجارية والعقود التي تجري عليها 
ويحتوي على العديد من الخدمات مثل طلب مستخرج سجل تجاري طلب تجديد طلب شهادة بيانات تحديث بيانات اضافة منشأة مسجلة غير مدرجه داخل شركاتي و استدلال عن السجل وغيرها`
    },
    {
        name: 'registerproperty',
        title: 'خدمات الشهر العقاري',
        image: 'static/media/registerproperty.jpg',
        description: `
        الجهة القانونية الوحيدة  والمنوط بها دون غيرها قانونا توثيق وشهر وتسجيل وقيد وصياغة وتحرير كافة أنواع المحررات والعقود تنقسم مصلحة الشهر العقاري إلى قسمين الشهر العقاري حيث يقوم فيه موظف الشهر العقاري بتسجيل وثائق الأملاك العقارية وما يتبعها من حجج ورهونات وسندات ويمكن الرجوع إلى ذلك التسجيل من قبل البائع والمشتري للتأكد من سلامة الملكية والقسم التاني لتسجيل الوثائق  واخيرا فان طرق التوثيق ثلاث ( المحررات الرسمية الموثقة – التصديق على التوقيعات – إثبات تاريخ المحررات العرفية) مثل زواج المصريين من الأجانب والعكس ويقدم العديد من الخدمات مثل ترجمة عقد مُشهر واستخراج شهادة تصرفات عقارية واستخراج صورة من منشور فني واستخراج صورة من منشور مالي واستخراج شهادة تصرفات عقارية
        `
    },
    {
        name: 'insurance',
        title: 'خدمات التأمين الاجتماعي ',
        image: 'static/media/insurance.jpg',
        description: `
        هو نظام إجباري تم فرضه بواسطة الحكومة كحماية للمواطنين العاملين من أخطار ككبر السن والمرض المفاجئ وحوادث العمل والوفاة فهو نظام هادف للاحتياط من نتائج المخاطر الاجتماعية ويتم تطبيقه من خلال الشركات التابعة للحكومة حيث يتم اقتطاع جزء من الراتب بشكل دوري ووضعه في صندوق التأمين الاجتماعي وتشمل العديد من الخدمات كالاستعلام عن الرقم التأميني والاستعلام عن اخر مدة تأمينية والاستعلام عن مدة الاشتراك والأجور الخاصة بكل مدة في التأمين الاجتماعي الخ….
        `
    },
    {
        name: 'supply',
        title: 'خدمات التموين',
        image: 'static/media/supply.jpg',
        description: `
        امدادات اجتماعية تقدمها الحكومة بأسعار مخفضة عن أسعار السوق وتشمل العديد من السلع الأساسية وبعض السلع الثانوية وتكون لعدد معين من أفراد الأسرة  وتحتوي على العديد من الخدمات تفعيل بطاقة التموين وضم أفراد الأسرة ونقل من محافظة لأخري وإصدار بطاقة تموين جديدة وإصدار بدل فاقد او تألف أيضًا
        `
    },
    {
        name: 'civilaffairs',
        title: 'خدمات الاحوال المدنية',
        image: 'static/media/civil.jpg',
        description: `
        العمليات التي يتم إنشاؤها والإشراف عليها وتوجيهها من قبل ممثلين حكوميين وتشمل العديد من الخدمات مثل استبدال بطاقة الهوية الوطنية التالفة واستبدال بطاقة الهوية الوطنية المفقودة وإصدار شهادة ميلاد آلية مطبوعة مسبقًا أو شهادة وفاة
        `
    },
    {
        name: 'vehicle',
        title: 'خدمات مركباتي',
        image: 'static/media/vehicle.jpg',
        description: `
        المركبات هي الات النقل التي تنقلنا من مكان لاخر ولها أنواع مختلفة وتضم هذه الخدمة العديد من الخدمات:
١. تَظلُم على مخالفات رخص مركبات
٢. سداد المخالفات
٣. تجديد رخصة مركبة
٤. بدل فاقد رخصة مركبة
٥. بدل تالف رخصة مركبة
٦. تحرير توثيق عقد بيع مركبة
٧. تحرير توكيل بيع مركبة
٨. تحرير توكيل إدارة مركبة
٩. استعلام عن مخالفات رخصة مركبة
١٠. التأكد من صحة بيانات مركبة
١١. سداد مخالفات مركبة لمالك آخر
        `
    },
    {
        name: 'auth',
        title: 'خدمات التوثيق',
        image: 'static/media/auth.jpg',
        description: `
        التوثيق يتوافر به العديد من الخدمات مثل تحرير توكيل عام في القضايا.تحرير إقرار بالشطب.تحرير إقرار رسمي. تحرير توكيل عام رسمي. تحرير توكيل فيما يخص الأمور الزوجية.الاستعلام عن سريان محرر ومُميكن.
        تحرير إقرار تصحيح محرر وموثق.اكتب محررك.معاملاتي المميكنة.
- حجز ميعاد. استعلام عن كثافة فروع المكاتب المميكنة. تحرير توكيل رسمي شامل «بنوك - عام».تحرير إقرار فيما يتعلق بعدم وجود تعديلات على البيانات المساحية.
        `
    },
]

const featured = ['housing', 'education', 'vehicle', 'supply', 'civilaffairs']

const getQueryParams = (search) => {
    let queryParams = {}
    const params = search.replace('?', '').split('&')
    params.forEach(param => {
        const values = param.split('=')
        queryParams[values[0]] = values[1]
    })
    return queryParams
}

const loadFeatured = () => {
    const container = document.getElementById('featured_services')
    const template = document.getElementById('featued_service_template')
    let content = ''

    featured.forEach(f => {
        const service = services.find(s => s.name === f)

        if (service) {
            content += template.innerHTML
            .replaceAll('{service_name}', service.name)
            .replaceAll('{service_title}', service.title)
            .replace('{service_description}', service.description)
            .replace('{service_image}', service.image)
        }
    })

    container.innerHTML = content
    container.classList.add('slideRight')
}

const loadServices = () => {
    loadFeatured()
    const params = getQueryParams(window.location.search)
    const container = document.getElementById('all_services')
    const allTemplate = document.getElementById('all_services_template')
    const service = services.find(s => s.name === params.service)

    if (service) {
        const detailTemplate = document.getElementById('service_detail_template')
        const allHeader = document.getElementById('all_header')
        let content  = ''
        let newServices = [...services]
        newServices.splice(services.indexOf(service), 1)

        content += detailTemplate.innerHTML
        .replaceAll('{service_name}', service.name)
        .replaceAll('{service_title}', service.title)
        .replace('{service_description}', service.description)
        .replace('{service_image}', service.image)
        allHeader.remove()

        newServices.forEach(service => {
            content += allTemplate.innerHTML
            .replaceAll('{service_name}', service.name)
            .replaceAll('{service_title}', service.title)
            .replace('{service_description}', service.description)
            .replace('{service_image}', service.image)
        })
        document.title = service.title + ' - بوابة الحكومة المصرية'
        container.innerHTML = content
    }
    else {
        if (params.service) window.history.replaceState(null, null, 'services.html')
        let content  = ''

        services.forEach(service => {
            content += allTemplate.innerHTML
            .replaceAll('{service_name}', service.name)
            .replaceAll('{service_title}', service.title)
            .replace('{service_description}', service.description)
            .replace('{service_image}', service.image)
        })
        document.title = 'الخدمات - بوابة الحكومة المصرية'
        container.innerHTML = content
    }
}